app/views/users/show.html.erb


<% @user.games.each do |g| %>
---
SELECT `games`.* FROM `games` INNER JOIN `likes` ON `games`.`id` = `likes`.`game_id` WHERE `likes`.`user_id` = 1