app/views/games/index.html.erb

                    <%= link_to game_like_path(id: g.id, game_id: g.id), method: :delete do %>
                        <i class="fas fa-heart"></i><%= g.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`game_id` = 1

                    <%= link_to game_likes_path(id: g.id, game_id: g.id), method: :post do %>
                        <i class="far fa-heart"></i><%= g.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`game_id` = 2

                        <%= link_to game_like_path(id: g.id, game_id: g.id), method: :delete do %>
                            <i class="fas fa-heart"></i><%= g.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`game_id` = 1

                        <%= link_to game_likes_path(id: g.id, game_id: g.id), method: :post do %>
                            <i class="far fa-heart"></i><%= g.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`game_id` = 5