app/views/games/show.html.erb

          <%= link_to game_like_path(@game), method: :delete do %>
             <p>いいねを取り消す</p><%= @game.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`game_id` = 1

          <%= link_to game_likes_path(@game), method: :post do %>
             <p>いいね</p><%= @game.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`game_id` = 1

  <% else %>
      <p>いいねの数 = </p><%= @game.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`game_id` = 1