app/controllers/games_controller.rb

SELECT COUNT(*) FROM `playlists` INNER JOIN `playlistgames` ON `playlists`.`id` = `playlistgames`.`playlist_id` WHERE `playlistgames`.`game_id` = 2
---
    def index
        if params[:search] == nil
            if params[:tag_id].present?
                @game = Tag.find(params[:tag_id]).games.order(id: "DESC").page(params[:page]).per(3)
            else
                @game= Game.all.order(id: "DESC").page(params[:page]).per(3)
            end
        elsif params[:search] == ''
            if params[:tag_id].present?
                @game = Tag.find(params[:tag_id]).game_tags.order(id: "DESC").page(params[:page]).per(3)
            else
                @game= Game.all.order(id: "DESC").page(params[:page]).per(3)
            end
        else
            if params[:tag_id].present?
                @game = Game.where("body LIKE ? ",'%' + params[:search] + '%').page(params[:page]).per(3).and(Tag.find(params[:tag_id]).games).order(id: "DESC").page(params[:page]).per(3)
            else
            #部分検索
                @game = Game.where("body LIKE ? ",'%' + params[:search] + '%').page(params[:page]).per(3)
            end
        end

        #ランキング表示(3位まで)
        @rank_games = Game.all.sort {|a,b| b.playlists.count <=> a.playlists.count}.first(3)

SELECT `games`.* FROM `games` WHERE `games`.`id` = 3 LIMIT 1
---
    def edit
        @game = Game.find(params[:id])

DELETE FROM `games` WHERE `games`.`id` = 3
---
    def destroy
        game = Game.find(params[:id])
        game.destroy