app/controllers/games_controller.rb

SELECT COUNT(*) FROM `games`
SELECT `games`.* FROM `games` ORDER BY `games`.`id` DESC LIMIT 3 OFFSET 0
SELECT `games`.* FROM `games`
---
    def index
        if params[:search] == nil
            @game= Game.all.page(params[:page]).per(3)
        elsif params[:search] == ''
            @game= Game.all.page(params[:page]).per(3)

SELECT `games`.* FROM `games` WHERE `games`.`id` = NULL LIMIT 1
---
    def show
        @game = Game.find(params[:id])

INSERT INTO `games` (`body`, `title`, `user_id`, `created_at`, `updated_at`) VALUES ('カロン', 'あっり', 1, '2021-03-20 11:47:20.086387', '2021-03-20 11:47:20.086387')
---
    def create
        game = Game.new(game_params)
        game.user_id = current_user.id
        if game.save

SELECT `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1
---
    def edit
        @game = Game.find(params[:id])

SELECT `games`.* FROM `games` WHERE `games`.`id` = 3 LIMIT 1
DELETE FROM `games` WHERE `games`.`id` = 3
---
    def destroy
        game = Game.find(params[:id])
        game.destroy