app/controllers/likes_controller.rb

INSERT INTO `likes` (`game_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-03-20 07:37:04.015922', '2021-03-20 07:37:04.015922')
---
    def create
        like = current_user.likes.create(game_id: params[:game_id]) #user_idとtweet_idの二つを代入

SELECT `likes`.* FROM `likes` WHERE `likes`.`game_id` = 1 AND `likes`.`user_id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1
---
    def destroy
        like = Like.find_by(game_id: params[:game_id], user_id: current_user.id)
        like.destroy