app/controllers/playlists_controller.rb

INSERT INTO `playlists` (`content`, `user_id`, `created_at`, `updated_at`) VALUES ('飲み歌１', 1, '2021-03-20 17:34:11.952435', '2021-03-20 17:34:11.952435')
---
    def create
        playlist = Playlist.new(playlist_params)
        playlist.user_id = current_user.id

        if playlist.save

SELECT `playlists`.* FROM `playlists`
---
    def index
        @playlists = Playlist.all

SELECT `playlists`.* FROM `playlists` WHERE `playlists`.`id` = 1 LIMIT 1
SELECT `games`.* FROM `games` INNER JOIN `playlistgames` ON `games`.`id` = `playlistgames`.`game_id` WHERE `playlistgames`.`playlist_id` = 1 ORDER BY `rank` ASC
SELECT `games`.* FROM `games` INNER JOIN `playlistgames` ON `games`.`id` = `playlistgames`.`game_id` WHERE `playlistgames`.`playlist_id` = 1
---
    def show
        @playlist = Playlist.find(params[:id])
        @games = @playlist.games.order(:rank)
        @randam_games = @playlist.games.order("RANDOM()")

SELECT `playlists`.* FROM `playlists` WHERE `playlists`.`id` = 1 LIMIT 1
---
    def edit
        @playlist = Playlist.find(params[:id])

SELECT `playlists`.* FROM `playlists` WHERE `playlists`.`id` = 1 LIMIT 1
SELECT `games`.* FROM `games` WHERE `games`.`id` = 4 LIMIT 1
SELECT `playlistgames`.* FROM `playlistgames` WHERE `playlistgames`.`id` = 13 LIMIT 1
UPDATE `playlistgames` SET `playlistgames`.`rank` = NULL, `playlistgames`.`updated_at` = '2021-03-20 19:46:37.673780' WHERE `playlistgames`.`id` = 17
---
    def update
        playlist = Playlist.find(params[:id])

        @playlistgames = playlistgames_params.keys.each do |id|
            playlistgame = Playlistgame.find(id)
            playlistgame.update_attributes(playlistgames_params[id])