app/controllers/playlistgames_controller.rb

    def destroy
        playlistgame = Playlistgame.find_by(playlist_id: params[:playlist_id], game_id: params[:id])
        playlistgame.destroy
---
SELECT `playlistgames`.* FROM `playlistgames` WHERE `playlistgames`.`playlist_id` = 1 AND `playlistgames`.`game_id` IS NULL LIMIT 1
DELETE FROM `playlistgames` WHERE `playlistgames`.`id` = 1