app/controllers/users_controller.rb

    def following
        #@userがフォローしているユーザー
        @user  = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def followers
        #@userをフォローしているユーザー
        @user  = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1