app/models/user.rb

        def already_liked?(game)
          self.likes.exists?(game_id: game.id)
---
SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`game_id` = 1 LIMIT 1