app/models/user.rb

INSERT INTO `relationships` (`follower_id`, `following_id`, `created_at`, `updated_at`) VALUES (2, 1, '2021-03-20 13:39:29.321847', '2021-03-20 13:39:29.321847')
---
      def follow(user)
        following_relationships.create!(following_id: user.id)

DELETE FROM `relationships` WHERE `relationships`.`id` = 1
---
      def unfollow(user)
        following_relationships.find_by(following_id: user.id).destroy

SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`game_id` = 1 LIMIT 1
---
      def already_liked?(game)
        self.likes.exists?(game_id: game.id)