app/views/playlists/edit.html.erb

SELECT `games`.* FROM `games`
---

        <%= collection_check_boxes(:playlist, :game_ids, Game.all, :id, :title) do |b| %>

SELECT `games`.* FROM `games`
SELECT `playlistgames`.* FROM `playlistgames` WHERE `playlistgames`.`playlist_id` = 1
---

    <% @playlist.playlistgames.each do |playlistgame| %>