app/views/playlists/new.html.erb

    <%= f.label :games %><br />
    <%= collection_check_boxes(:playlist, :game_ids, Game.all, :id, :title) do |b| %>
---
SELECT `games`.* FROM `games`